import random
from django.core.management.base import BaseCommand
from productlist.models import Product

class Command(BaseCommand):
    help = 'Populates the database with 100 product items'

    def handle(self, *args, **kwargs):
#         products = [
#     "Молоко", "Яйца", "Хлеб", "Картофель", "Помидоры", "Огурцы", "Масло растительное", "Мука", "Рис", "Макароны",
#     "Курица", "Говядина", "Свинина", "Сельдь", "Консервы горошка", "Шоколад", "Сахар", "Соль", "Чай", "Кофе",
#     "Сок апельсиновый", "Вода минеральная", "Пиво", "Вино красное", "Рыба свежая", "Мороженое", "Бананы", "Яблоки",
#     "Мандарины", "Апельсины", "Грейпфруты", "Лимоны", "Петрушка", "Укроп", "Салат", "Лук", "Чеснок", "Капуста",
#     "Морковь", "Перец", "Баклажаны", "Кабачки", "Творог", "Кефир", "Сметана", "Йогурт", "Сыр", "Сливки", "Сырок",
#     "Майонез", "Кетчуп", "Горчица", "Мед", "Арахис", "Орехи", "Изюм", "Финики", "Курага", "Креветки", "Мидии",
#     "Морской коктейль", "Кальмары", "Оливки", "Каперсы", "Тунец", "Лосось", "Семга", "Форель", "Окунь", "Сазан",
#     "Карп", "Судак", "Щука", "Сыр брынза", "Сыр фета", "Сыр моцарелла", "Сыр пармезан", "Сыр чеддер", "Сыр гауда",
#     "Сыр рокфор", "Сыр камамбер", "Сыр бри", "Колбаса", "Ветчина", "Сосиски", "Бекон", "Сало", "Маслины", "Соленья",
#     "Маринады", "Халва", "Пастила", "Мармелад", "Имбирь", "Вафли", "Пряники", "Карамель", "Зефир", "Печенье"
# ]

        products = [ "Макароны спагетти", "Оливковое масло", "Мед липовый", "Фасоль консервированная", "Кетчуп острый", "Сметана нежирная", "Творог обезжиренный", "Йогурт греческий", "Горчица дижонская", "Сельдь под шубой", "Консервы горошка с морковью", "Ржаной хлеб", "Картофель фри", "Пельмени", "Ветчина копченая", "Белый рис", "Сладкий перец", "Кабачки цуккини", "Сыр пармезан", "Красная рыба", "Оливки без косточек", "Карамельный соус", "Овсяные хлопья", "Кукурузные хлопья", "Миндальные орешки", "Кешью", "Арахисовая паста", "Минеральная вода газированная", "Фруктовый сок мультифрукт", "Газированный напиток кола", "Чай зеленый", "Чернослив", "Финики сухофрукты", "Гранат", "Авокадо", "Киноа", "Гречка", "Помидоры черри", "Брусника свежая", "Ананас", "Манго", "Маракуйя", "Киви", "Лайм", "Шпинат", "Морская капуста", "Минтай", "Форель филе", "Осьминог"]
        for i in products:
                # Генерируем случайное слово как имя продукта
            price = random.randint(1, 1000)
            Product.objects.create(name=i, price=price)
        self.stdout.write(self.style.SUCCESS('Successfully populated the database with 100 product items.'))